// @ts-nocheck
const METADATA = {
    website: "",
    author: "BerlinerBY",
    name: "Belarusian localization",
    version: "1.0.0",
    id: "translations",
    description: "Translate game to Belarusian language",
    minimumGameVersion: ">=1.5.0",
    doesNotAffectSavegame: true,
};

class Mod extends shapez.Mod {
    init() {
        shapez.LANGUAGES["be"] = {
            name: "Беларуская",
            data: {
                "steamPage": {
                "shortText": "shapez - гэта гульня аб будаўніцтве фабрык для аўтаматызацыі стварэння і апрацоўкі ўсё больш складаных фігур на карце, што бясконца пашыраецца.",
                "discordLinkShort": "Official Discord",
                "intro": "Вам падабаюцца гульні з аўтаматызацыяй? Тады вы ў правільным месцы! Shapez - гэта разслабляльная гульня, дзе вам трэба будаваць фабрыкі для аўтаматызацыі стварэння геаметрычных фігур. З кожным узроўнем, фігуры будуць больш складанымі і вам спатрэбіцца выкарыстоўваць больш месца на бясконцай мапе. Калі гэтага вам недастаткова, вам таксама будзе патрэбна ствараць фігуры ў экспаненцыяльных памерах, каб наталяць попыты - тут дапаможа толькі маштабаванне. Спачатку давядзецца толькі абрабляць фігуры, потым трэба будзе здабываць і змешваць колеры. Купляючы гульню у Steam, вы атрымліваеце доступ да поўнай версіі, але вы так сама можаце паспрабаваць дэма-версію гульні і вырашыць пазней!",
                "what_others_say": "Што людзі кажуць аб shapez",
                "nothernlion_comment": "Гэта вельмі выдатная гульня - Я цудоўна баўлю ў ёй час, не звяртаючы ўвагі на тое, як хутка ён ляціць.",
                "notch_comment": "Трасца. Мне трэба спаць, але я разабраўся як зрабіць камп'ютар у shapez.",
                "steam_review_comment": "Гэта гульня скрала маё жыццё і я не хачу яго вяртаць. Вельмі крутая гульня. Увесь час думаю, як зрабіць мае лініі больш эфектыўнымі."
                },
                "global": {
                "loading": "Запампоўка",
                "error": "Памылка",
                "loggingIn": "Уваход у сістэму",
                "loadingResources": "Downloading additional resources (<percentage> %)",
                "thousandsDivider": " ",
                "decimalSeparator": ",",
                "discount": "-<percentage>%",
                "discountSummerSale": "SPECIAL PROMOTION! Offer ends 7 July",
                "suffix": {
                    "thousands": "тыс.",
                    "millions": "млн.",
                    "billions": "млрд",
                    "trillions": "трлн"
                },
                "infinite": "∞",
                "time": {
                    "oneSecondAgo": "адну секунду таму",
                    "xSecondsAgo": "<x> секунд таму",
                    "oneMinuteAgo": "адну хвіліну таму",
                    "xMinutesAgo": "<x> хвілін таму",
                    "oneHourAgo": "адну гадзіну таму",
                    "xHoursAgo": "<x> гадзін таму",
                    "oneDayAgo": "адзін дзень таму",
                    "xDaysAgo": "<x> дзён таму",
                    "secondsShort": "<seconds>сек.",
                    "minutesAndSecondsShort": "<minutes>хв. <seconds>сек.",
                    "hoursAndMinutesShort": "<hours>гадз. <minutes>хв.",
                    "xMinutes": "<x> хв."
                },
                "keys": {
                    "tab": "TAB",
                    "control": "CTRL",
                    "alt": "ALT",
                    "escape": "ESC",
                    "shift": "SHIFT",
                    "space": "SPACE"
                }
                },
                "demoBanners": {
                "title": "Дэма-версія",
                "titleV2": "Гуляйце зараз ў поўную версію для:",
                "intro": "Атрымайце поўную гульню <strong>зараз</strong>, каб разблакаваць:<ul> <li>Усе 26 узроўняў + бясконцая безкаштоўная гульня</li> <li>22 новых будынка</li> <li>Падтрымка мадыфікацый</li> <li>Дасягненні</li> <li>Цёмны рэжым</li> <li>... і шмат іншага</li> </ul>",
                "playtimeDisclaimer": "Поўная версія гульні змяшчае больш за <strong>20 адзін дадатковага кантэнту</strong>!",
                "playtimeDisclaimerDownload": "Вы можаце працягнуць сваю захаваную гульню ў поўнай версіі! Націсніце <strong>сюды</strong>, каб зпампаваць ваша захоўванне.",
                "playerCount": "<playerCount> гульцоў як і вы зараз гуляюць у shapez у Steam",
                "untilEndOfDemo": "Да канца дэманстрацыі "
                },
                "mainMenu": {
                "play": "Гуляць",
                "continue": "Працягнуць",
                "newGame": "Новая гульня",
                "changelog": "Спіс змен",
                "subreddit": "Reddit",
                "importSavegame": "Імпартаваць",
                "openSourceHint": "Гэтая гульня з адкрытым зыходным кодам!",
                "discordLink": "Афіцыйны Discord Сервер",
                "helpTranslate": "Дапамагчы з перакладам!",
                "madeBy": "Зрабіў <author-link>",
                "noActiveSavegames": "Захоўванні не знойдзены - Націсніце \"Гуляць\", каб пачаць новую гульню!",
                "playFullVersionV2": "Набылі shapez у Steam? Вы можаце гуляць у поўную версію прама ў вашым Браўзеры!",
                "playFullVersionStandalone": "Вы таксама можаце гуляць у поўную версію ў Браўзеры!",
                "playingFullVersion": "Цяпер вы гуляеце ў поўную версію!",
                "logout": "Выхад",
                "browserWarning": "Прабачце, але гульня, як вядома, працуе павольна ў вашым браўзеры! Зпампуйце поўную версію гульні альбо Google Chrome, каб атрымаць больш задавальнення ад гульні.",
                "savegameLevel": "Узровень <x>",
                "savegameLevelUnknown": "Невядомы ўзровень",
                "savegameUnnamed": "Без назвы",
                "puzzleMode": "Рэжым Складанкі",
                "back": "Назад",
                "puzzleDlcText": "Вам падабаецца кампанаваць і аптымізаваць фабрыкі? Атрымайце дапаўненне Puzzle DLC у Steam для большага задавальнення!",
                "puzzleDlcWishlist": "Дадаць у спіс жаданага!",
                "puzzleDlcViewNow": "Праглядзець DLC",
                "mods": {
                    "title": "Актыўныя моды",
                    "warningPuzzleDLC": "Puzzle DLC не сумяшчальнае з мадыфікацыямі. Калі ласка, адключыце моды, каб гуляць у дапаўненне."
                }
                },
                "puzzleMenu": {
                "play": "Гуляць",
                "edit": "Рэдагаваць",
                "title": "Рэжым Складанкі",
                "createPuzzle": "Стварыць",
                "loadPuzzle": "Запампаваць",
                "reviewPuzzle": "Праглядзець і апублікаваць",
                "validatingPuzzle": "Праверка складанкі",
                "submittingPuzzle": "Публікацыя складанкі",
                "noPuzzles": "Зараз, у гэтым раздзеле няма складанкі.",
                "dlcHint": "Ужо набылі дапаўненне? Пераканайцеся, што яно актываванае правым клікам па shapez у вашай бібліятэцы, пункт Уласцівасці > DLC.",
                "categories": {
                    "levels": "Узроўні",
                    "new": "Новыя",
                    "top-rated": "Найлепш адзначаныя",
                    "mine": "Мае",
                    "easy": "Лёгкія",
                    "medium": "Сярэднія",
                    "hard": "Складаныя",
                    "completed": "Завершаныя",
                    "official": "Навучанне",
                    "trending": "папулярнае сёння",
                    "trending-weekly": "Папулярнае на гэтым тыдні",
                    "categories": "Катэгорыі",
                    "difficulties": "Па складанасці",
                    "account": "Мае складанкі",
                    "search": "Пошук"
                },
                "search": {
                    "action": "Пошук",
                    "placeholder": "Увядзіце назву складанкі ці імя аўтара",
                    "includeCompleted": "Паказваць завершаныя",
                    "difficulties": {
                    "any": "Любой",
                    "easy": "Лёгка",
                    "medium": "Сярэдне",
                    "hard": "Складана"
                    },
                    "durations": {
                    "any": "Любой",
                    "short": "Кароткая (< 2 хв.)",
                    "medium": "Сярэдняя",
                    "long": "Доўгая (> 10 хв.)"
                    }
                },
                "difficulties": {
                    "easy": "Легка",
                    "medium": "Сярэдне",
                    "hard": "Складана",
                    "unknown": "Без адзнакі"
                },
                "validation": {
                    "title": "Нядзейсная складанка",
                    "noProducers": "Калі ласка, змясціце Пастаяннага Вытворцу!",
                    "noGoalAcceptors": "Калі ласка, змясціце Мэтапрымальнік!",
                    "goalAcceptorNoItem": "Аднаму альбо некалькім Мэтапрымальнікам не прызначаны прадмет. Дастаўце фігуру фігуру да іх, каб прызначыць мэту.",
                    "goalAcceptorRateNotMet": "Адзін альбо некалькі Мэтапрымальнікаў не атрымліваць дастаткова прадметаў. Пераканайцеся, што індыкатары зялёныя ва ўсіх прымальнікаў.",
                    "buildingOutOfBounds": "Адзін альбо некалькі будынкаў па-за межамі зоны для будаўніцтва. Павялічце зону альбо выдаліце будынак.",
                    "autoComplete": "Ваша складанка аўтаматычна завяршае сама сябе! Калі ласка, упэўніцеся, што вашыя Пастаянныя Вытворцы не дастаўляюць прадметы напрамкі Мэтапрымальнікам."
                }
                },
                "dialogs": {
                "buttons": {
                    "ok": "Добра",
                    "delete": "Выдаліць",
                    "cancel": "Скасаваць",
                    "later": "Пазней",
                    "restart": "Перазапуск",
                    "reset": "Скінуць",
                    "getStandalone": "Купіць у Steam",
                    "deleteGame": "Я ведаю, што раблю",
                    "viewUpdate": "Праверыць абнаўленні",
                    "showUpgrades": "Праглядзець паляпшэнні",
                    "showKeybindings": "Паглядзець прывязку клавіш",
                    "retry": "Зноўку",
                    "continue": "Працягнуць",
                    "playOffline": "Гуляць па-за сеткай"
                },
                "importSavegameError": {
                    "title": "Памылка падчас імпартавання",
                    "text": "Не атрымалася імпартаваць вашу захаваную гульню:"
                },
                "importSavegameSuccess": {
                    "title": "Захоўванне імпартавана",
                    "text": "Ваша захаваная гульня паспяхова імпартавана. "
                },
                "gameLoadFailure": {
                    "title": "Гульня паламаная",
                    "text": "Не атрымалася загрузіць ваша захоўванне гульні."
                },
                "confirmSavegameDelete": {
                    "title": "Пацвердзіць выдаленне",
                    "text": "Вы ўпэўнены, што хочаце выдаліць захоўванне гульні?<br><br> '<savegameName>' якая <savegameLevel> узроўня<br><br> Гэта дзеянне немагчыма адмяніць!"
                },
                "savegameDeletionError": {
                    "title": "Не атрымалася выдаліць",
                    "text": "Не атрымалася выдаліць захаванне гульні:"
                },
                "restartRequired": {
                    "title": "Патрэбны перазапуск",
                    "text": "Вам патрэбна перазапусціць гульню, каб прымяніць налады."
                },
                "editKeybinding": {
                    "title": "Змяніць прызначэнне клавіш",
                    "desc": "Націсніце клавішу ці кнопку мышы, якую вы хочаце прызначыць, альбо escape каб скасаваць."
                },
                "resetKeybindingsConfirmation": {
                    "title": "Скінуць прывязку клавіш",
                    "desc": "Гэта скіне прызначэнні ўсіх клавіш да стандартнага значэння. Калі ласка, пацвердзіце."
                },
                "keybindingsResetOk": {
                    "title": "Прывязка клавіш скінута",
                    "desc": "Усе прызначэнні клавіш скінуты да іх стандартнага значэння!"
                },
                "featureRestriction": {
                    "title": "Дэма-версія",
                    "desc": "Вы спрабавалі атрымаць доступ да функцыі (<feature>), якая недаступная ў дэманстрацыйнай версіі гульні. Падумайце над атрыманнем поўнай версіі гульні, каб атрымаць больш асалоды ад гульні!"
                },
                "oneSavegameLimit": {
                    "title": "Абмежаванне захоўванняў",
                    "desc": "У дэма-версіі вы можаце захоўваць толькі адну гульню за раз. Калі ласка, выдаліце ​​існуючае або атрымайце поўную версію ў Steam!"
                },
                "updateSummary": {
                    "title": "Новае абнаўленне!",
                    "desc": "Вось змены з вашай апошняй гульні:"
                },
                "upgradesIntroduction": {
                    "title": "Разблакаваць паляпшэнні",
                    "desc": "Усе фігуры, што вы вырабляеце, могуць быць выкарыстаны для разблакавання паляпшэнняў - <strong>раем не выдаляць вашыя старыя фабрыкі!</strong> Укладку з паляпшэннямі можна знайсці ў правым верхнім куце экрана."
                },
                "massDeleteConfirm": {
                    "title": "Пацвердзіць выдаленне",
                    "desc": "Вы выдаляеце шмат будынкаў (дакладней <count>)! Вы ўпэўнены, што жадаеце зрабіць гэта?"
                },
                "massCutConfirm": {
                    "title": "Пацверджанне выразання",
                    "desc": "Вы выразаеце шмат будынкаў (дакладна <count>)! Вы ўпэўнены, што жадаеце гэта зрабіць?"
                },
                "massCutInsufficientConfirm": {
                    "title": "Пацвердзіць выразанне",
                    "desc": "Вы не можаце дазволіць сабе ўставіць гэтую вобласць! Вы ўпэўнены, што жадаеце выразаць яе?"
                },
                "blueprintsNotUnlocked": {
                    "title": "Яшчэ не разблакавана",
                    "desc": "Дасягніце 12-га ўзроўню, каб разблакаваць Чарцяжы!"
                },
                "keybindingsIntroduction": {
                    "title": "Карысныя прывязкі клавіш",
                    "desc": "Гэта гульня мае шмат прызначаных клавіш, якія палегчаць будаўніцтва фабрык. Вось некалькі, але абавязкова <strong>азнаёмцеся з прывязкамі клавіш</strong>!<br><br>  <code class='keybinding'>CTRL</code> + цягнуць: выдзеліць зону.<br> <code class='keybinding'>SHIFT</code>: трымайце, каб размясціць некалькі копій аднаго будынку.<br> <code class='keybinding'>ALT</code>: змяніць накірунак размешчанай канвеернай стужкі.<br>"
                },
                "createMarker": {
                    "title": "Новая пазнака",
                    "titleEdit": "Рэдагаваць пазнаку",
                    "desc": "Дайце ён інфарматыўную назву, вы таксама можаце ўключыць <strong>код</strong> фігуры (Які вы можаце згенераваць <link>тут</link>)"
                },
                "editSignal": {
                    "title": "Усталяваць сігнал",
                    "descItems": "Абярыце папярэдне-вызначаны элемент:",
                    "descShortKey": "... ці ўвядзіце <strong>код</strong> фігуры (Які вы можаце згенераваць <link>тут</link>)"
                },
                "editConstantProducer": {
                    "title": "Усталяваць прадмет"
                },
                "markerDemoLimit": {
                    "desc": "У дэма-версіі вы можаце стварыць толькі дзве пазнакі. Атрымайце поўную версію гульні, каб ствараць неабмежаваную колькасць пазнак!"
                },
                "exportScreenshotWarning": {
                    "title": "Экспартаваць здымак",
                    "desc": "Вы збіраецеся экспартаваць вашу базы ў выглядзе скрыншота. Звярніце ўвагу, што для вялікай базы гэта будзе даволі павольна і патэнцыйна можа прывесці да збою гульні!"
                },
                "renameSavegame": {
                    "title": "Перайменаваць захоўванне",
                    "desc": "Вы можаце змяніць назву захоўвання тут."
                },
                "tutorialVideoAvailable": {
                    "title": "Інструктаж даступны",
                    "desc": "Для гэтага ўзроўня даступны відэа-інструктаж! Жадаеце праглядзець яго?"
                },
                "tutorialVideoAvailableForeignLanguage": {
                    "title": "Інструктаж даступны",
                    "desc": "Для гэтага ўзроўня даступны відэа-інструктаж, але ён даступны толькі на Аглійскай мове! Жадаеце праглядзець яго?"
                },
                "puzzleLoadFailed": {
                    "title": "Загрузка складанак немагчыма",
                    "desc": "На жаль, складанкі не могуць быць загружаны:"
                },
                "submitPuzzle": {
                    "title": "Апублікаваць складанку",
                    "descName": "Дайце імя вашай складанцы:",
                    "descIcon": "Калі ласка, увядзіце кароткі ўнікальны ключ, які будзе выкарыстоўвацца як значок вашай складанкі (Вы можаце згенераваць яго <link>тут</link>, альбо выбраць адзін з выпадкова прапанаваных ніжэй)",
                    "placeholderName": "Назва складанкі"
                },
                "puzzleResizeBadBuildings": {
                    "title": "Змена памеру немагчыма",
                    "desc": "Вы не можаце зменшыць зону, бо тады некалькі будынкаў будуць па-за ейнымі межамі."
                },
                "puzzleLoadError": {
                    "title": "Дрэнная складанка",
                    "desc": "Не атрымалася загрузіць складанку:"
                },
                "offlineMode": {
                    "title": "Па-за сеткавы рэжым",
                    "desc": "Немагчыма падключыцца да серверу, таму гульня будзе запушчана ў па-за сеткавым рэжыме. Калі ласка, пераканайцеся ў наяўнасці актыўнага падключэнне да інтэрнэту."
                },
                "puzzleDownloadError": {
                    "title": "Памылка загрузкі",
                    "desc": "Памылка падчас спампоўкі складанкі:"
                },
                "puzzleSubmitError": {
                    "title": "Памылка публікацыі",
                    "desc": "Памылка падчас публікацыі складанкі:"
                },
                "puzzleSubmitOk": {
                    "title": "Складанка апублікавана",
                    "desc": "Віншуем! Ваша складанка апублікавана і цяпер у яе могуць гуляць іншыя. Цяпер вы можаце знайсці яе ў раздзеле \"Мае складанкі\"."
                },
                "puzzleCreateOffline": {
                    "title": "Па-за сеткавы рэжым",
                    "desc": "Паколькі вы па-за сеткай, вы не можаце захоўваць і/альбо публікаваць вашыя складанкі. Вы ўпэўнены, што жадаеце працягнуць?"
                },
                "puzzlePlayRegularRecommendation": {
                    "title": "Рэкамендацыя",
                    "desc": "Я <strong>настойліва</strong> рэкамендую дасягнуць як мінімум 12-га ўзроўня перад гульнёй у дапаўненне Puzzle DLC, інакш вы можаце сутыкнуцца з незнаёмымі для вас механікамі. Жадаеце працягнуць?"
                },
                "puzzleShare": {
                    "title": "Кароткі ключ скапіяваны",
                    "desc": "Кароткі ключ складанкі (<key>) быў скапіяваны ў буфер абмену! Яго можна ўвесці ў меню складанак для доступу да складанкі."
                },
                "puzzleReport": {
                    "title": "Паскардзіцца на складанку",
                    "options": {
                    "profane": "Абражае",
                    "unsolvable": "Не мае рашэння",
                    "trolling": "Тролінг"
                    }
                },
                "puzzleReportComplete": {
                    "title": "Дзякуй за ваш водгук!",
                    "desc": "Скарга была даслана."
                },
                "puzzleReportError": {
                    "title": "Не атрымалася паскардзіцца",
                    "desc": "Не атрымалася апрацаваць вашу скаргу:"
                },
                "puzzleLoadShortKey": {
                    "title": "Увядзіце кароткі ключ",
                    "desc": "Увядзіце кароткі ключ складанкі, каб загрузіць яе."
                },
                "puzzleDelete": {
                    "title": "Выдаліць складанку?",
                    "desc": "Вы ўпэўнены, што жадаеце выдаліць '<title>'? Дзеянне не магчыма скасаваць!"
                },
                "modsDifference": {
                    "title": "Папярэджанне пра моды",
                    "desc": "Усталяваныя на дадзены момант моды адрозніваюцца ад модаў у захоўванні. Гэта можа прывесці да паломкі захоўвання гульні або не загрузкі ўвогуле. Вы ўпэўнены, што хочаце працягнуць?  ",
                    "missingMods": "Адсутныя моды",
                    "newMods": "Нядаўна ўсталяваныя моды"
                },
                "resourceLoadFailed": {
                    "title": "Памылка загрузкі рэсурсаў",
                    "demoLinkText": "Дэма-версія shapez у Steam",
                    "descWeb": "Адзін альбо некалькі рэсурсаў не могуць быць загружаны. Упэўніцеся ў наяўнасці стабільнага інтэрнэту і паспрабуйце яшчэ раз. Калі гэта не спрацуе, пераканайцеся, што адключаны ўсе пашырэнні браўзэра (у тым ліку блакіроўшчыкі рэкламы).<br><br> У якасці альтэрнатывы, вы можаце гуляць у <demoOnSteamLinkText>. <br><br> Памылка:",
                    "descSteamDemo": "Адзін альбо некалькі рэсурсаў не могуць быць загружаны. Паспрабуйце перазапусціць гульню - Калі гэта не дапаможа, паспрабуйце праверыць файлы гульні, альбо пераўсталяваць яе з Steam. <br><br> Памылка:"
                },
                "steamSsoError": {
                    "title": "Выхад з поўнай версіі гульні",
                    "desc": "Вы выйшлі з поўнай браўзернай версіі гульні, бо ў вас альбо нестабільнае інтэрнэт злучэнне, альбо вы ўжо гуляеце на іншай прыладзе.<br><br> Калі ласка, пераканайцеся, што вы не адкрылі shapez у іншай укладцы браўзера ці на іншым камп'ютары праз Steam.<br><br> Вы можаце ўвайсці ізноў у галоўным меню."
                },
                "steamSsoNoOwnership": {
                    "title": "Вы не валодаеце поўнай версіяй",
                    "desc": "Каб гуляць у поўную версію гульні ў браўзеры, вам патрэбна мець базавую версію гульні і дапаўненне Pazzle DLC у вашым уліковым запісе Steam.<br><br> Калі ласка, пераканайцеся, што вы валодаеце абодвума, увайдзіце праз правільны ўліковы запіс Steam і паспрабуйце ізноў."
                }
                },
                "ingame": {
                "keybindingsOverlay": {
                    "moveMap": "Рухацца",
                    "selectBuildings": "Выдзеліць вобласць",
                    "stopPlacement": "Спыніць размяшчэнне",
                    "rotateBuilding": "Павярнуць будынак",
                    "placeMultiple": "Размясціць некалькі",
                    "reverseOrientation": "Змяніць накірунак",
                    "disableAutoOrientation": "Адключыць аўтаматычны накірунак",
                    "toggleHud": "Пераключыць інтэрфэйс",
                    "placeBuilding": "Размясціць будынак",
                    "createMarker": "Стварыць пазнаку",
                    "delete": "Выдаліць",
                    "pasteLastBlueprint": "Паставіць апошні чарцёж",
                    "lockBeltDirection": "Уключыць планіроўшчык канвеераў",
                    "plannerSwitchSide": "Змяніць накірунак планіроўшчыка",
                    "cutSelection": "Выразаць",
                    "copySelection": "Капіяваць",
                    "clearBelts": "Адчысціць лініі",
                    "clearSelection": "Адчысціць выдзеленае",
                    "pipette": "Піпетка",
                    "switchLayers": "Пераключыць слаі"
                },
                "colors": {
                    "red": "Чырвоны",
                    "green": "Зялёны",
                    "blue": "Сіні",
                    "yellow": "Жоўты",
                    "purple": "Фіялетавы",
                    "cyan": "Блакітны",
                    "white": "Белы",
                    "black": "Чорны",
                    "uncolored": "Без колеру"
                },
                "buildingPlacement": {
                    "cycleBuildingVariants": "Націсніце <key> каб перабраць варыянты.",
                    "hotkeyLabel": "Прызначаная клавіша: <key>",
                    "infoTexts": {
                    "speed": "Хуткасць",
                    "range": "Дыяпазон",
                    "storage": "Сховішча",
                    "oneItemPerSecond": "1 прадмет/сек.",
                    "itemsPerSecond": "<x> прадм./сек.",
                    "itemsPerSecondDouble": "(x2)",
                    "tiles": "<x> плітак"
                    }
                },
                "levelCompleteNotification": {
                    "levelTitle": "Узровень <level>",
                    "completed": "Завершана",
                    "unlockText": "Разблакаваны <reward>!",
                    "buttonNextLevel": "Наступны ўзровень"
                },
                "notifications": {
                    "newUpgrade": "Новае паляпшэнне разблакавана!",
                    "gameSaved": "Ваша гульня захавана.",
                    "freeplayLevelComplete": "Узровень <level> завершаны!"
                },
                "shop": {
                    "title": "Паляпшэнні",
                    "buttonUnlock": "Палепшыць",
                    "tier": "Ранг <x>",
                    "maximumLevel": "МАКСІМАЛЬНЫ ЎЗРОВЕНЬ (Хуткасць x<currentMult>)"
                },
                "statistics": {
                    "title": "Статыстыка",
                    "dataSources": {
                    "stored": {
                        "title": "Захоўваецца",
                        "description": "Паказвае колькасць фігур у Цэнтры."
                    },
                    "produced": {
                        "title": "Вырабляецца",
                        "description": "Паказвае ўсе фігуры вашай фабрыкі, што вырабляюцца, улічваючы прамежкавыя прадукты."
                    },
                    "delivered": {
                        "title": "Дастаўляецца",
                        "description": "Паказвае фігуры, што дастаўляюцца ў Цэнтр."
                    }
                    },
                    "noShapesProduced": "Ніякіх формаў пакуль не выраблялася.",
                    "shapesDisplayUnits": {
                    "second": "<shapes> / с",
                    "minute": "<shapes> / хв",
                    "hour": "<shapes> / г"
                    }
                },
                "settingsMenu": {
                    "playtime": "У гульні",
                    "buildingsPlaced": "Будынкаў",
                    "beltsPlaced": "Канвеераў"
                },
                "tutorialHints": {
                    "title": "Патрэбна дапамога?",
                    "showHint": "Атрымаць параду",
                    "hideHint": "Зачыніць"
                },
                "blueprintPlacer": {
                    "cost": "Кошт"
                },
                "waypoints": {
                    "waypoints": "Пазнакі",
                    "hub": "Цэнтр",
                    "description": "Націсніце ЛКМ па пазнацы, каб перамясціцца да яе, ПКМ - каб яе выдаліць.<br><br>Націсніце <keybinding> каб стварыць пазнаку на месцы вашай камеры, ці <strong>ПКМ</strong> каб стварыць яе там, дзе знаходзіцца ваш курсор.",
                    "creationSuccessNotification": "Пазнака створана."
                },
                "shapeViewer": {
                    "title": "Слаі",
                    "empty": "Пусты",
                    "copyKey": "Капіяваць ключ"
                },
                "interactiveTutorial": {
                    "title": "Інструктаж",
                    "hints": {
                    "1_1_extractor": "Размясціце <strong>здабывальнік</strong> паверх <strong>фігуры кола</strong> каб здабыць яго!",
                    "1_2_conveyor": "Злучыце здабывальнік з Цэнтрам з дапамогай <strong>канвеернай стужкі</strong>!<br><br>Парада: <strong>Націсніце і працягніце</strong> стужку вашай мышу!",
                    "1_3_expand": "У гэтай гульні <strong>ВАМ НЕ ТРЭБА БЯЗДЗЕЙНІЧАЦЬ</strong>! Будуйце больш здабывальнікаў і стужак, каб хутчэй выканаць мэту.<br><br>Парада: Утрымлівайце <strong>SHIFT</strong> каб змясціць некалькі здабывальнікаў і выкарыстоўвайце <strong>R</strong> каб павярнуць іх.",
                    "2_1_place_cutter": "Цяпер змясціце <strong>Рэзчык</strong> каб разрэзаць круг на дзве паловы!<br><br> PS: Рэзчык заўсёды рэжа фігуру <strong>па вертыкалі</strong> незалежна ад яе арыентацыі.",
                    "2_2_place_trash": "Рэзчык можа <strong>забівацца</strong> Выкарыстоўвайце <strong>Сметніцу</strong> каб пазбавіцца ад пакуль што (!) не патрэбных лішкаў.",
                    "2_3_more_cutters": "Выдатная праца! Цяпер змясціце <strong>яшчэ 2 рэзчыка</strong> каб паскорыць гэты павольны працэс!<br><br>PS: Выкарыстоўвайце <strong>клавішы 0-9</strong> каб мець хуткі доступ да будынкаў!",
                    "3_1_rectangles": "Давайце здабудзем квадраты! <strong>Пабудуйце 4 здабывальніка</strong> і злучыце іх з цэнтрам.<br><br>PS: Утрымлівайце <strong>SHIFT</strong> while dragging a belt to activate the belt planner!",
                    "21_1_place_quad_painter": "Размясціцце <strong>Фарбавальнік (х4)</strong> і здабудзьце трохі <strong>кругоў</strong>, <strong>белай</strong> і <strong>чырвонай</strong> фарбы!",
                    "21_2_switch_to_wires": "Пераключыцеся на слой з дратамі націскаючы <strong>E</strong>!<br><br> Затым <strong>падключыце ўсе 4 уваходы</strong> фарбавальніка з дапамогай дроту!",
                    "21_3_place_button": "Выдатна! Цяпер змясціце <strong>Пераключальнік</strong> і злучыце іх дротам!",
                    "21_4_press_button": "Націсніце на пераключальнік, каб ён пачаў <strong>выдаваць сігнал \"Ісціна\"</strong> і гэта актывавала фарбавальнік.<br><br> PS: Не абавязкова падключаць усе выхады! Паспрабуйце падключаць толькі два.",
                    "1_2_hold_and_drag": "Утрымлівайце і перацягвайце."
                    }
                },
                "connectedMiners": {
                    "one_miner": "1 Здабывальнік",
                    "n_miners": "<amount> Здабывальнікаў",
                    "limited_items": "Абмежавана да <max_throughput>"
                },
                "watermark": {
                    "title": "Дэма-версія",
                    "desc": "Націсніце сюды, каб убачыць перавагі поўнай версіі!",
                    "get_on_steam": "Атрымаць у Steam"
                },
                "standaloneAdvantages": {
                    "titleV2": "Набудзьце поўную версію ў Steam, каб разблакаваць:",
                    "titleExpiredV2": "Дэма-версія пройдзена!",
                    "titleEnjoyingDemo": "Спадабалася дэма-версія?",
                    "no_thanks": "Не, дзякуй!",
                    "points": {
                    "levels": {
                        "title": "19 Новых узроўняў",
                        "desc": "Больш за 20 гадзін дадатковага кантэнту!"
                    },
                    "wires": {
                        "title": "Драты",
                        "desc": "Цэлы новы слой!"
                    },
                    "darkmode": {
                        "title": "Начны рэжым",
                        "desc": "Дайце адпачыць сваім вачам!"
                    },
                    "buildings": {
                        "title": "22 Новых будынка",
                        "desc": "Для поўнай аўтаматызацыі вашай фабрыкі!"
                    },
                    "achievements": {
                        "title": "45 Дасягненняў",
                        "desc": "Атрымайце ўсе з іх!"
                    },
                    "mods": {
                        "title": "Падтрымка мадыфікацый!",
                        "desc": "Даступна больш за 80 модаў!"
                    },
                    "markers": {
                        "title": "∞ Пазнак",
                        "desc": "Хопіць блукаць па фабрыцы!"
                    },
                    "support": {
                        "title": "Падтрымайце мяне",
                        "desc": "Я распрацоўваю shapez у мой вольны час!"
                    }
                    }
                },
                "puzzleEditorSettings": {
                    "zoneTitle": "Зона",
                    "zoneWidth": "Шырыня",
                    "zoneHeight": "Вышыня",
                    "trimZone": "Абрэзаць",
                    "clearItems": "Адчысціць элементы",
                    "clearBuildings": "Адчысціць будынкі",
                    "resetPuzzle": "Скінуць складанку",
                    "share": "Падзяліцца",
                    "report": "Паскардзіцца"
                },
                "puzzleEditorControls": {
                    "title": "Рэдактар складанак",
                    "instructions": [
                    "1. Змясціце <strong>Пастаяннага Вытворцу</strong>, каб забяспечыць гульца фігурамі і фарбамі",
                    "2. Стварыце адну альбо некалькі фігур, якую вы хочаце, каб гулец пабудаваў іх пазней, і дастаўце іх да аднаго ці некалькіх <strong>Мэтапрымальнікаў</strong>",
                    "3. Пасля таго, як Мэтапрымальнік атрымае фігуру на працягу пэўнага часу, ён  <strong>зберагае гэта як цэль</strong> якую гулец павінен апрацаваць пазней (Пазначае <strong>зялёным значком</strong>).",
                    "4. Націсніце <strong>кнопку блакавання</strong> на будынку каб выключыць яго.",
                    "5. Пасля таго, як вы націсніце на кнопку агляду, ваша складанка будзе праверана і вы зможаце апублікаваць яе.",
                    "6. У апублікаванай складанцы, <strong>усе будынкі будуць выдалены</strong> акрамя Вытворцаў і Мэтапрымальнікаў. Гэта тая часціна, якую гулец павінен вырашыць самастойна - у гэтым увесь сэнс складанкі :)"
                    ]
                },
                "puzzleCompletion": {
                    "title": "Складанка завершана!",
                    "titleLike": "Націсніце на сардэчка, калі вам спадабалася складанка:",
                    "titleRating": "Наколькі складаная была гэта складанка?",
                    "titleRatingDesc": "Ваш водгук дапаможа мне зрабіць лепшую сістэму парад у будучыні",
                    "continueBtn": "Працягнуць гульню",
                    "menuBtn": "Меню",
                    "nextPuzzle": "Наступная складанка"
                },
                "puzzleMetadata": {
                    "author": "Аўтар",
                    "shortKey": "Кароткі ключ",
                    "rating": "Складанасць",
                    "averageDuration": "Сяр. Працягласць",
                    "completionRate": "Адсотак завяршэнняў"
                }
                },
                "shopUpgrades": {
                "belt": {
                    "name": "Стужкі, размеркавальнікі і тунэлі",
                    "description": "Хут. x<currentMult> → x<newMult>"
                },
                "miner": {
                    "name": "Здабыча",
                    "description": "Хут. x<currentMult> → x<newMult>"
                },
                "processors": {
                    "name": "Наразанне, варочанне і стасаванне",
                    "description": "Хут. x<currentMult> → x<newMult>"
                },
                "painting": {
                    "name": "Змешванне і фарбаванне",
                    "description": "Хут. x<currentMult> → x<newMult>"
                }
                },
                "buildings": {
                "hub": {
                    "deliver": "Дастаўце",
                    "toUnlock": "каб разблакаваць",
                    "levelShortcut": "УЗР",
                    "endOfDemo": "Канец дэмкі"
                },
                "belt": {
                    "default": {
                    "name": "Канвеерная стужка",
                    "description": "Транспартуе прадметы, утрымлівайце і працягніце для размяшчэння некальлкіх."
                    }
                },
                "miner": {
                    "default": {
                    "name": "Здабывальнік",
                    "description": "Размясціце над фігурай ці колерам, каб здабываць яго."
                    },
                    "chainable": {
                    "name": "Здабывальнік (Ланц.)",
                    "description": "Размясціце над фігурай ці колерам, каб здабываць яго. Можна аб'яднаць у ланцуг."
                    }
                },
                "underground_belt": {
                    "default": {
                    "name": "Тунэль",
                    "description": "Дазваляе транспартаваць рэсурсы пад будынкамі і іншымі стужкамі."
                    },
                    "tier2": {
                    "name": "Тунэль, ранг II",
                    "description": "Дазваляе транспартаваць рэсурсы пад будынкамі і іншымі стужкамі."
                    }
                },
                "balancer": {
                    "default": {
                    "name": "Балансёр",
                    "description": "Шматфункцыянальны - Раўнамерна размяркоўвае ўсе ўваходы паміж усімі выхадамі."
                    },
                    "merger": {
                    "name": "Аб'ядноўвальнік",
                    "description": "Аб'ядноўвае дзве канвеерныя стужкі ў адну."
                    },
                    "merger-inverse": {
                    "name": "Аб'ядноўвальнік",
                    "description": "Аб'ядноўвае дзве канвеерныя стужкі ў адну."
                    },
                    "splitter": {
                    "name": "Раздзяляльнік",
                    "description": "Раздзяляе адну канвеерную стужку на дзве."
                    },
                    "splitter-inverse": {
                    "name": "Раздзяляльнік",
                    "description": "Раздзяляе адну канвеерную стужку на дзве."
                    }
                },
                "cutter": {
                    "default": {
                    "name": "Рэзчык",
                    "description": "Рэжа фігуры па вертыкалі і выводзіць абедзве паловы. <strong>Калі вы выкарыстоўваеце толькі адну частку, знішчыце іншую, бо яна можа захраснуць у механізме!</strong>"
                    },
                    "quad": {
                    "name": "Рэзчык (4 вых.)",
                    "description": "Рэжа фігуры па вертыкалі і выводзіць абедзве паловы. <strong>Калі вы выкарыстоўваеце толькі адну частку, знішчыце іншую, бо яна можа захраснуць у механізме!</strong>"
                    }
                },
                "rotater": {
                    "default": {
                    "name": "Рататар",
                    "description": "Паварочвае фігуры па гадзіннікавай стрэлцы на 90 градусаў."
                    },
                    "ccw": {
                    "name": "Рататар (-90)",
                    "description": "Паварочвае фігуры супраць гадзіннікавай стрэлкі на 90 градусаў."
                    },
                    "rotate180": {
                    "name": "Рататар (180)",
                    "description": "Паварочвае фігуры па гадзіннікавай стрэлцы на 180 градусаў."
                    }
                },
                "stacker": {
                    "default": {
                    "name": "Стасавальнік",
                    "description": "Камбінуе два элементы, на адным слаі, калі гэта магчыма, інакш, правы элемент кладзецца над левым."
                    }
                },
                "mixer": {
                    "default": {
                    "name": "Мяшалка фарб",
                    "description": "Змешвае два колеры."
                    }
                },
                "painter": {
                    "default": {
                    "name": "Фарбавальнік",
                    "description": "Фарбуе фігуры з левага ўваходу ў колер з верхняга."
                    },
                    "mirrored": {
                    "name": "Фарбавальнік",
                    "description": "Фарбуе фігуры з левага ўваходу ў колер з верхняга."
                    },
                    "double": {
                    "name": "Фарбавальнік (х2)",
                    "description": "Фарбуе фігуры, што прыйшлі з левага ўваходу, колерам з верхняга."
                    },
                    "quad": {
                    "name": "Фарбавальнік (х4)",
                    "description": "Дазваляе вам пафарбаваць кожную частку асобна. Толькі частка з <strong>сігналам \"Ісціна\"</strong> на слаі Дратоў будзе пафарбавана!"
                    }
                },
                "trash": {
                    "default": {
                    "name": "Сметніца",
                    "description": "Прымае фігуры з усіх бакоў і знішчае іх. Назаўсёды."
                    }
                },
                "storage": {
                    "default": {
                    "name": "Сховішча",
                    "description": "Захоўвае лішкі прадметаў, да пэўнай ёмістасці. Левы ўваход прыярытэтны і можа быць выкарыстаны як перапаўняльны затвор."
                    }
                },
                "wire": {
                    "default": {
                    "name": "Дрот",
                    "description": "Перадае сігналы, якімі могуць быць фігуры, колеры ці лагічныя сігналы (1 ці 0). Драты розных колераў нельга падлучыць адзін да другога."
                    },
                    "second": {
                    "name": "Дрот",
                    "description": "Перадае сігналы, якімі могуць быць фігуры, колеры ці лагічныя сігналы (1 ці 0). Драты розных колераў нельга падлучыць адзін да другога."
                    }
                },
                "wire_tunnel": {
                    "default": {
                    "name": "Перасячэнне дроту",
                    "description": "Дазваляе двум дратам перасячыся не падключаючыся адзін да аднаго."
                    }
                },
                "constant_signal": {
                    "default": {
                    "name": "Пастаянны сігнал",
                    "description": "Выдае пастаянны сігнал, якім можа быць фігура, колер ці лагічны сігнал (1 ці 0)."
                    }
                },
                "lever": {
                    "default": {
                    "name": "Пераключальнік",
                    "description": "Можа пераключаць выдачу лагічнага сігналу (1 ці 0) на слаі дратоў. Гэты сігнал можна выкарыстоўваць для кантралявання кампанентаў, напрыклад фільтр прадметаў."
                    }
                },
                "logic_gate": {
                    "default": {
                    "name": "Лагічнае \"І\"",
                    "description": "Выдае лагічную \"1\", калі абодва ўваходы атрымліваюць сігнал \"Ісціна\". (Пад \"Ісцінай\" маецца на ўвазе фігура, колер ці лагічнае \"1\")"
                    },
                    "not": {
                    "name": "Лагічнае \"НЕ\"",
                    "description": "Выдае лагічную \"1\", калі ўваход атрымлівае сігнал \"Няпраўда\". (\"Няпраўда\" - супрацьлеглы \"Ісціне\" сігнал і адпавядае лагічнаму 0)"
                    },
                    "xor": {
                    "name": "Выключаючае \"ЦІ\"",
                    "description": "Выдае лагічную \"1\", калі адзін з уваходаў атрымлівае сігнал \"Ісціна\", але не абодва. (Пад \"Ісцінай\" маецца на ўвазе фігура, колер ці лагічнае \"1\")"
                    },
                    "or": {
                    "name": "Лагічнае \"ЦІ\"",
                    "description": "Выдае лагічную \"1\", калі адзін з уваходаў атрымлівае сігнал \"Ісціна. (Пад \"Ісцінай\" маецца на ўвазе фігура, колер ці лагічнае \"1\")"
                    }
                },
                "transistor": {
                    "default": {
                    "name": "Транзістар",
                    "description": "Прапускае ніжні сігнал, калі бакавы ўваход \"Ісцінны\" (фігура, колер ці лагічная \"1\")."
                    },
                    "mirrored": {
                    "name": "Транзістар",
                    "description": "Прапускае ніжні сігнал, калі бакавы ўваход \"Ісцінны\" (фігура, колер ці лагічная \"1\")."
                    }
                },
                "filter": {
                    "default": {
                    "name": "Фільтр",
                    "description": "Падключыце сігнал, каб направіць усе адпаведныя прадметы ўверх, а астатнія ўправа. Таксама ім можна кіраваць з дапамогай лагічных сігналаў."
                    }
                },
                "display": {
                    "default": {
                    "name": "Дысплэй",
                    "description": "Падключыце сігнал, каб паказаць яго на дысплэі - ім можа быць фігура, колер ці лагічны сігнал."
                    }
                },
                "reader": {
                    "default": {
                    "name": "Чытач стужкі",
                    "description": "Дазваляе вымяраць сярэднюю прапускную здольнасць стужкі. Выдае сігнал апошняга счытанага прадмета на слой дратоў (калі разблакавана)."
                    }
                },
                "analyzer": {
                    "default": {
                    "name": "Аналізатар фігур",
                    "description": "Аналізуе верхнюю правую частку самага ніжняга слою фігуры і вяртае яе форму і колер."
                    }
                },
                "comparator": {
                    "default": {
                    "name": "Параўнальнік",
                    "description": "Вяртае лагічную \"1\", калі абодва сігналы абсалютна аднолькавыя. Можа параўноўваць фігуры, колеры і лагічныя сігналы."
                    }
                },
                "virtual_processor": {
                    "default": {
                    "name": "Віртуальны Працэсар",
                    "description": "Віртуальна разразае фігуры на дзве паловы."
                    },
                    "rotater": {
                    "name": "Віртуальны Рататар",
                    "description": "Віртуальна паварочвае фігуру па гадзіннікавай стрэлцы."
                    },
                    "unstacker": {
                    "name": "Віртуальны Распакоўшчык",
                    "description": "Віртуальна здабывае верхні слой фігуры ў правы выхад, а рэшту ў левы."
                    },
                    "stacker": {
                    "name": "Віртуальны Стасавальнік",
                    "description": "Віртуальна кладзе правую фігуру на левую."
                    },
                    "painter": {
                    "name": "Віртуальны Фарбавальнік",
                    "description": "Віртуальна фарбуе фігуру з ніжняга ўваходу ў колер з правага."
                    }
                },
                "item_producer": {
                    "default": {
                    "name": "Генератар элементаў",
                    "description": "Даступны толькі ў рэжыме пясочніцы, выдае атрыманы на слаі дратоў сігнал у якасці фігуры на звычайны слой."
                    }
                },
                "constant_producer": {
                    "default": {
                    "name": "Пастаянны Вытворца",
                    "description": "Пастаянна выводзіць пэўную форму альбо колер."
                    }
                },
                "goal_acceptor": {
                    "default": {
                    "name": "Мэтапрымальнік",
                    "description": "Дастаўце фігуры з мэтапрымальнік, каб усталяваць іх як мэту."
                    }
                },
                "block": {
                    "default": {
                    "name": "Блакіратар",
                    "description": "Дазваляе вам заблакаваць плітку."
                    }
                }
                },
                "storyRewards": {
                "reward_cutter_and_trash": {
                    "title": "Наразанне фігур",
                    "desc": "Вы толькі што разблакавалі <strong>рэзчык</strong>, які рэжа фігуры вертыкальна папалам  <strong>незалежна ад яго арыентацыі</strong>!<br><br> Абавязкова пазбаўцеся лішкаў, інакш <strong>яны захраснуць</strong> - Для гэтых мэт я дам вам <strong>сметніцу</strong>, якая знішчае ўсё, што патрапіць!"
                },
                "reward_rotater": {
                    "title": "Варочанне",
                    "desc": "<strong>Рататар</strong> разблакаваны! Ён паварочвае фігуры па гадзіннікавай стрэлцы на 90 градусаў."
                },
                "reward_painter": {
                    "title": "Фарбаванне",
                    "desc": "<strong>Фарбавальнік</strong> разблакаваны! Здабудзьце трохі колераў з адпаведных крыніц (як вы зрабілі гэта з фігурамі) і скамбініруйце іх з фігурамі ў фарбавальніку, каб пафарбаваць фігуры!<br><br>PS: Калі вы дальтонік, даступны <strong>рэжым высокай кантраснасці</strong> ў наладах!"
                },
                "reward_mixer": {
                    "title": "Змешванне колераў",
                    "desc": "<strong>Мяшалка</strong> разблакавана! Яна змешвае колеры шляхам <strong>дабаўкі</strong>!"
                },
                "reward_stacker": {
                    "title": "Аб'яднанне фігур",
                    "desc": "Цяпер вы можаце камбінаваць фігуры ў <strong>Стасавальніку</strong>! Фігуры аб'ядноўваюцца з двух бакоў і, калі іх можна паставіць побач, яны <strong>аб'яднаюцца</strong>. Калі не, фігура з правага ўваходу <strong>будзе накладзена</strong> на левую!"
                },
                "reward_balancer": {
                    "title": "Балансёр",
                    "desc": "Шматфункцыянальны <strong>балансёр</strong> разблакаваны! Ён выкарыстоўваецца для будавання больш вялікіх фабрык шляхам <strong>раздзялення і аб'яднання прадметаў</strong> паміж некалькімі стужкамі!"
                },
                "reward_tunnel": {
                    "title": "Тунэль",
                    "desc": "<strong>Тунэль</strong> разблакаваны! Вы можаце ствараць тунэлі перадавання прадметаў пад стужкамі і будынкамі!"
                },
                "reward_rotater_ccw": {
                    "title": "Зваротнае варочанне",
                    "desc": "Вы разблакавалі варыянт <strong>рататара</strong>! Ён дазваляе паварочваць фігуры супраць гадзіннікавай стрэлкі! Каб пабудаваць яго, выберыце рататара і <strong>націсніце 'T' каб змяніць варыянты</strong>!"
                },
                "reward_miner_chainable": {
                    "title": "Здабывальнік (ланц.)",
                    "desc": "Вы разблакавалі <strong>Ланцуговы здабывальнік</strong>! Ён можа <strong>накіроўваць свае рэсурсы</strong> ў іншы здабывальнік, каб здабываць рэсурсы больш эфектыўна!<br><br> PS: Звычайны Здабывальнік быў заменены на вашай панэлі інструментаў!"
                },
                "reward_underground_belt_tier_2": {
                    "title": "Тунэль, ранг II",
                    "desc": "Вы разблакавалі новы варыянт <strong>тунэля</strong> - Ён мае <strong>большую дальнасць</strong>, вы таксама можаце перакрыжаваць іх!"
                },
                "reward_merger": {
                    "title": "Аб'ядноўвальнік",
                    "desc": "Вы разблакавалі <strong>аб'ядноўвальнік</strong> - варыянт <strong>балансёра</strong> - Ён прымае два ўводы і аб'ядноўвае іх у адну стужку!"
                },
                "reward_splitter": {
                    "title": "Раздзяляльнік",
                    "desc": "Вы разблакавалі <strong>раздзяляльнік</strong> - варыянт <strong>балансёра</strong> - Ён прымае адзін увод і раздзяляе іх на два!"
                },
                "reward_belt_reader": {
                    "title": "Чытач стужкі",
                    "desc": "Вы разблакавалі <strong>чытач стужкі</strong>! Ён дазваляе вымяраць сярэднюю прапускную здольнасць стужкі. <br><br> Пачакайце разблакавання слою дратоў - тады ён стане больш карысным!"
                },
                "reward_cutter_quad": {
                    "title": "Рэзчык (х4)",
                    "desc": "Вы разблакавалі варыянт <strong>рэзчыка</strong> - Ён дазваляе разразаць фігуры на <strong>чатыры часткі</strong> замест дзвух!"
                },
                "reward_painter_double": {
                    "title": "Падвоены Фарбавальнік",
                    "desc": "Вы разблакавалі варыянт <strong>фарбавальнік</strong> - Ён працуе таксама, як і звычайны, але апрацоўвае <strong>дзве фігуры замест адной</strong> і спажывае адзін колер замест двух!"
                },
                "reward_storage": {
                    "title": "Сховішча",
                    "desc": "Вы разблакавалі <strong>сховішча</strong> - Яно дазваляе захоўваць прадметы пэўнай колькасці!<br><br> Левы ўваход прыярытэтны, таму вы можаце выкарыстоўваць яго як <strong>перапаўняльны затвор</strong>!"
                },
                "reward_blueprints": {
                    "title": "Чарцяжы",
                    "desc": "Цяпер вы можаце <strong>капіяваць і ўстаўляць</strong> часткі вашай фабрыкі! Выберыце зону (Трымайце CTRL і цягніце вашу мышу), і націсніце \"С\" каб скапіяваць.<br><br>Ставіць чарцяжы - <strong>рэч не безкаштоўная</strong>, спачатку трэба стварыць <strong>фігуры чарцяжоў</strong>, каб дазволіць сабе гэта! (Тыя, што вы толькі што даставілі)"
                },
                "reward_rotater_180": {
                    "title": "Рататар (180)",
                    "desc": "Вы разблакавалі 180 градусны <strong>рататар</strong>! - Ён дазваляе паварочваць фігуры на 180 градусаў! (Сюрпрыз! :D)"
                },
                "reward_wires_painter_and_levers": {
                    "title": "Драты і Фарбавальнік(х4)",
                    "desc": "Вы разблакавалі <strong>Слой Дратоў</strong>: Гэта дадатковы слой паверх звычайнага і ён прыносіць новыя механнікі!<br><br> Спачатку, Я разблакаваў вам <strong>Фарбавальнік(х4)</strong> - Падключыце ўваходы, з якіх вы хочаце фарбаваць, праз слой дратоў!<br><br> Каб пераключыць слой, націсніце <strong>Е</strong>.<br><br> PS: <strong>Уключыце парады</strong> у меню, каб актываваць навучанне па дратах!"
                },
                "reward_filter": {
                    "title": "Фільтр",
                    "desc": "Вы разблакавалі <strong>Фільтр</strong>! Ён накіроўвае элементы альбо на верхні, альбо на правы выхад у залежнасці ад таго, супадаюць яны з сігналам са слоя дратоў ці не. <br><br> Вы таксама можаце перадаць лагічны сігнал (1 ці 0) каб поўнасцю актываваць ці адключыць яго."
                },
                "reward_display": {
                    "title": "Дысплэй",
                    "desc": "Вы разблакавалі <strong>Дысплэй</strong> - Падключыце сігнал на слой дратоў, каб візуалізіраваць яго!<br><br> PS: Памятаеце што Чытач стужкі і Сховішча выводзяць апошні прачытаны элемент? Паспрабуйце паказаць іх на дысплэі!"
                },
                "reward_constant_signal": {
                    "title": "Пастаянны Сігнал",
                    "desc": "Вы разблакавалі <strong>пастаянны сігнал</strong> на слаі дратоў! Ён карысны, напрыклад, каб злучаць <strong>Фільтры</strong>.<br><br> Пастаянны сігнал можа выдаваць <strong>фігуру</strong>, <strong>колер</strong> ці <strong>лагічны сігнал</strong> (1 ці 0)."
                },
                "reward_logic_gates": {
                    "title": "Лагічныя элементы",
                    "desc": "Вы разблакавалі <strong>лагічныя элементы</strong>! Вам не абавязкова адчуваць захапленне, але гэта вельмі крута!<br><br> З лагічнымі элементамі вы можаце вылічаць лагічныя аперацыі \"І\", \"ЦІ\", \"НЕ-ЦІ\" і \"НЕ\".<br><br> Як бонус, я так сама дам вам <strong>транзістар</strong>!"
                },
                "reward_virtual_processing": {
                    "title": "Віртуальная апрацоўка",
                    "desc": "Я толькі што даў вам цэлую купу новых будынкаў, якія дазволяць вам <strong>імітаваць апрацоўку фігур</strong>!<br><br> Зараз вы можаце імітаваць рэзчыкі, рататары, стасавальнікі і трохі на слаі дратоў! З гэтым у вас ёсць тры варыянты працягу гульні:<br><br> - Пабудаваць <strong>аўтаматызаваную машыну</strong>, каб ствараць любую фігуру па запыту Цэнтра (Рэкамендую паспрабаваць).<br><br> - Пабудаваць нешта класнае з дратамі.<br><br> - Працягваць гуляць як раней.<br><br> Што б вы не абралі, вы атрымаеце асалоду ад гульні!"
                },
                "no_reward": {
                    "title": "Наступны ўзровень",
                    "desc": "Гэты ўзровень не дае вам узнагароды, але наступны дасць!<br><br>PS: Лепей не разбурайце вашу існуючаю фабрыку - Пазней вам спатрэбяцца <strong>ўсе</strong> гэтыя фігуры каб <strong>разблакаваць паляпшэнні</strong>!"
                },
                "no_reward_freeplay": {
                    "title": "Наступны ўзровень",
                    "desc": "Віншую!"
                },
                "reward_freeplay": {
                    "title": "Вольная гульня",
                    "desc": "У вас атрымалася! Вы разблакавалі <strong>рэжым вольнай гульні</strong>! Гэта азначае, што цяпер фігуры генеруюцца <strong>выпадкова</strong>!<br><br> Так як Цэнтр будзе патрабаваць пэўную <strong>прапускную здольнасць</strong>, Я вельмі раю будаваць машыну, яка аўтаматычна стварае патрэбную форму!<br><br> Цэнтр выводзіць патрэбную фігуру на слаі дратоў, таму вам патрэбна будзе толькі прааналізаваць яе і аўтаматычна наладзіць сваю фабрыку пад запыт."
                },
                "reward_demo_end": {
                    "title": "Канец дэма-версіі",
                    "desc": "Вы дасягнулі канца дэма-версіі!"
                }
                },
                "mods": {
                "title": "Моды",
                "author": "Аўтар",
                "version": "Версія",
                "modWebsite": "Вэб-сайт",
                "openFolder": "Адкрыць папку з модам",
                "folderOnlyStandalone": "Адкрыць папку з модам магчыма толькі ў поўнай версіі з Steam.",
                "browseMods": "Праглядзець моды",
                "modsInfo": "Каб усталяваць і кіраваць модамі, скапіруйце іх у папку з модамі (скарыстайцеся кнопкай \"Адкрыць папку з модамі\").  Не забудзьцеся перазапусціць гульню пасля гэтага, інакш моды не будуць адлюстравацца.",
                "noModSupport": "Атрымайце поўную версію гульні ў Steam, каб усталяваць моды!",
                "browserNoSupport": "Праз абмежаванні браўзера, зараз магчыма ўсталёўваць моды толькі ў версіі Steam - Прабачце!",
                "togglingComingSoon": {
                    "title": "Хутка пабачымся",
                    "description": "У цяперашні час уключэнне або выключэнне модаў магчыма толькі шляхам капіравання файла мода з папкі mods/ або ў яе. Аднак магчымасць пераключаць іх тут плануецца ў будучым абнаўленні!"
                }
                },
                "settings": {
                "title": "Налады",
                "categories": {
                    "general": "Агульныя",
                    "userInterface": "Карыстальніцкі інтэрфэйс",
                    "advanced": "Пашыраныя",
                    "performance": "Прадукцыйнасць"
                },
                "versionBadges": {
                    "dev": "Распрацоўка",
                    "staging": "Тэставанне",
                    "prod": "Вытворчасць"
                },
                "buildDate": "Створана <at-date>",
                "tickrateHz": "<amount> Hz",
                "rangeSliderPercentage": "<amount> %",
                "newBadge": "Новае!",
                "labels": {
                    "uiScale": {
                    "title": "Маштаб інтэрфэйсу",
                    "description": "Змяняе памер карыстальніцкага інтэрфэйсу. Інтэрфэйс усё яшчэ будзе маштабіравацца ў залежнасці ад раздзяляльнасці, але гэта налада кантралюе ступень змянення.",
                    "scales": {
                        "super_small": "Вельмі малы",
                        "small": "Малы",
                        "regular": "Звычайны",
                        "large": "Вялікі",
                        "huge": "Велічэзны"
                    }
                    },
                    "autosaveInterval": {
                    "title": "Прамежак паміж аўтазахоўваннямі",
                    "description": "Кантралюе, як часта гульня будзе рабіць захаванні. Вы таксама можаце адключыць гэта.",
                    "intervals": {
                        "one_minute": "1 Хвіліна",
                        "two_minutes": "2 Хвіліны",
                        "five_minutes": "5 Хвілін",
                        "ten_minutes": "10 Хвілін",
                        "twenty_minutes": "20 Хвілін",
                        "disabled": "Адключыць"
                    }
                    },
                    "scrollWheelSensitivity": {
                    "title": "Чуллівасць маштабавання",
                    "description": "Змяняе чуллівасць маштабавання (колца мышы або трэкпада).",
                    "sensitivity": {
                        "super_slow": "Вельмі марудна",
                        "slow": "Марудна",
                        "regular": "Звычайна",
                        "fast": "Хутка",
                        "super_fast": "Вельмі хутка"
                    }
                    },
                    "movementSpeed": {
                    "title": "Хуткасць руху",
                    "description": "Змяняе хуткасць руху камеры падчас выкарыстання клавіятуры, альбо мышы.",
                    "speeds": {
                        "super_slow": "Вельмі марудна",
                        "slow": "Марудна",
                        "regular": "Звычайна",
                        "fast": "Хутка",
                        "super_fast": "Вельмі хутка",
                        "extremely_fast": "Экстрэмальна хутка"
                    }
                    },
                    "language": {
                    "title": "Мова",
                    "description": "Змена мовы. Уе пераклады зроблены карыстальнікамі і могуць быць няпоўнымі!"
                    },
                    "enableColorBlindHelper": {
                    "title": "Рэжым высока кантраснасці",
                    "description": "Дазваляе выкарыстоўваць розныя інструменты, якія дазваляюць гуляць у гульні, калі вы дальтонік."
                    },
                    "fullscreen": {
                    "title": "Паўнаэкранны рэжым",
                    "description": "Каб атрымаць больш задавальнення, раю гуляць у поўнаэкранным рэжыме. Даступна толькі ў поўнай версіі."
                    },
                    "soundsMuted": {
                    "title": "Заглушыць гукі",
                    "description": "Калі ўключана, яна глушыць усе гукавыя эфекты."
                    },
                    "musicMuted": {
                    "title": "Заглушыць музыку",
                    "description": "Калі ўключана, яна глушыць усю музыку."
                    },
                    "soundVolume": {
                    "title": "Гучнасць гукаў",
                    "description": "Усталюйце ўзровень гучнасці гукавых эфектаў."
                    },
                    "musicVolume": {
                    "title": "Гучнасць музыкі",
                    "description": "Усталюйце ўзровень гучнасці музыкі."
                    },
                    "theme": {
                    "title": "Тэма гульні",
                    "description": "Выберыце тэму гульні (светлая / цёмная).",
                    "themes": {
                        "dark": "Цёмная",
                        "light": "Светлая"
                    }
                    },
                    "refreshRate": {
                    "title": "Частата абнаўлення",
                    "description": "Вызначае, колькі гульнявых цыклаў будзе апрацавана за секунду. Звычайна, высокая частата абнаўлення дае лепшую дакладнасць, але горшую прадукцыйнасць. З нізкай частатой, прапускная здольнасць канвеерных стужак і машын можа быць не дакладна. Чакаецца, што ўсё што перавышае 60 Hz будзе адставаць!"
                    },
                    "alwaysMultiplace": {
                    "title": "Мультыразмяшчэнне",
                    "description": "Калі ўключана, усе будынкі будуць застануцца абранымі пасля размяшчэння, пакуль вы не скасуеце выбар. Гэта эквівалентна пастаяннаму ўтрымліванню SHIFT."
                    },
                    "offerHints": {
                    "title": "Парады і Інструктажы",
                    "description": "Калі ўключана, то падчас гульні прапануе падказкі і інструктажы. Таксама хавае пэўныя элементы інтэрфэйсу до пэўнага ўзроўню, каб аблегчыць уваход у гульню."
                    },
                    "enableTunnelSmartplace": {
                    "title": "Разумныя тунэлі",
                    "description": "Калі ўключана, размяшчае тунэлі і аўтаматычна выдаляе непатрэбную стужку. Гэта таксама дазваляе перацягваць тунэлі, і лішнія тунэлі будуць выдалены."
                    },
                    "vignette": {
                    "title": "Віньетка",
                    "description": "Уключае віньетку, якая прыцямняе куты экрану і робіць лягчэйшым чытанне тэксту."
                    },
                    "rotationByBuilding": {
                    "title": "Варочанне па тыпу будынка",
                    "description": "Кожны тып будынка індывідуальна запамінае паварот, які вы ўсталявалі ў яго апошні раз. Гэта можа быць зручней, калі вы часта пераключаецеся паміж размяшчэннем розных тыпаў будынкаў."
                    },
                    "compactBuildingInfo": {
                    "title": "Кампактная інфармацыя пра будынак",
                    "description": "Скарочвае інфармацыйныя палі для будынкаў, паказваючы толькі суадносіны. У іншым выпадку паказвае яшчэ апісанне і выяву."
                    },
                    "disableCutDeleteWarnings": {
                    "title": "Адключыць папярэджанні аб выразанні і выдаленні",
                    "description": "Адключае дыялогавыя вокны з папярэджаннямі, падчас выразання і выдалення больш за 100 аб'ектаў."
                    },
                    "lowQualityMapResources": {
                    "title": "Рэсурсы нізкай якасці на мапе",
                    "description": "Спрашчае адлюстраванне рэсурсаў у рэжыме мапы, каб палепшыць прадукцыйнасць. Гэта нават выглядае чысцей, раю паспрабаваць!"
                    },
                    "disableTileGrid": {
                    "title": "Адключыць сетку",
                    "description": "Адключэнне сеткі можа дапамагчы з прадукцыйнасцю. Гэта таксама робіць гульню крыху чысцей!"
                    },
                    "clearCursorOnDeleteWhilePlacing": {
                    "title": "Адчысціць курсор правай кнопкай мышы",
                    "description": "Стандартна - уключана, адчышчае курсор пры кожным націсканні ПКМ, пакуль у вас ёсць абраны будынак дла размяшчэння. Калі адключана, вы можаце выдаляць будынкі націснуўшы ПКМ у рэжыме размяшчэння будынкаў."
                    },
                    "lowQualityTextures": {
                    "title": "Тэкстуры нізкай якасці (Непрыгожа)",
                    "description": "Выкарыстоўвае тэкстуры нізкай якасці, каб палепшыць прадукцыйнасць. Гэта робіць гульню вельмі непрыгожай!"
                    },
                    "displayChunkBorders": {
                    "title": "Паказваць рамкі блокаў",
                    "description": "Гульня падзелена на блокі 16х16 плітак, калі налады ўключана, межы блокаў будуць бачнымі."
                    },
                    "pickMinerOnPatch": {
                    "title": "Выбраць здабывальнік над крыніцай рэсурсаў",
                    "description": "Стандартна - уключана, абірае здабывальнік, калі вы выкарыстоўваеце піпетку пры навядзенні на крыніцу рэсурсаў."
                    },
                    "simplifiedBelts": {
                    "title": "Спрашчэнне стужак (Непрыгожа)",
                    "description": "Адлюстроўвае прадметы на стужцы, толькі пры навядзенні на яе. Паляпшае прадукцыйнасць. Я не рэкамендую гуляць з гэтай наладай, калі вам дастаткова прадукцыйнасці."
                    },
                    "enableMousePan": {
                    "title": "Уключыць рухі мышой",
                    "description": "Дазваляе рухацца па мапе з дапамогай мышы, рухаючы яе да краёў экрану. Хуткасць залежыць ад налады Хуткасць руху."
                    },
                    "zoomToCursor": {
                    "title": "Набліжаць у накірунку курсора",
                    "description": "Калі актывавана, набліжэнне будзе адбывацца ў накірунку курсора мышы, інакш у цэнтр экрана."
                    },
                    "mapResourcesScale": {
                    "title": "Памер рэсурсаў на мапе",
                    "description": "Рэгулюе памер фігур у рэжыме мапы (пры аддаленні)."
                    },
                    "shapeTooltipAlwaysOn": {
                    "title": "Падказка фігуры - Паказваць заўжды",
                    "description": "Ці заўсёды паказваць падказку формы пры навядзенні на будынкі замест таго, каб утрымліваць клавішу \"ALT\"."
                    }
                }
                },
                "keybindings": {
                "title": "Прывязка клавіш",
                "hint": "Падказка: пераканайцеся, што выкарыстоўваеце CTRL, SHIFT і ALT! Яны дазваляюць наладзіць розныя варыянты размяшчэння.",
                "resetKeybindings": "Скінуць",
                "categoryLabels": {
                    "general": "Агульныя",
                    "ingame": "Гульня",
                    "navigation": "навігацыя",
                    "placement": "Размяшчэнне",
                    "massSelect": "Масавы выбар",
                    "buildings": "Хуткія клавішы будаўніцтва",
                    "placementModifiers": "Мадыфікатары размяшчэння",
                    "mods": "Налады модаў"
                },
                "mappings": {
                    "confirm": "Пацвердзіць",
                    "back": "Назад",
                    "mapMoveUp": "Уверх",
                    "mapMoveRight": "Управа",
                    "mapMoveDown": "Уніз",
                    "mapMoveLeft": "Улева",
                    "mapMoveFaster": "Паскорыцца",
                    "centerMap": "Цэнтраваць",
                    "mapZoomIn": "Прыблізіць",
                    "mapZoomOut": "Аддаліць",
                    "createMarker": "Стварыць пазнаку",
                    "menuOpenShop": "Паляпшэнні",
                    "menuOpenStats": "Статыстыка",
                    "menuClose": "Зачыніць меню",
                    "toggleHud": "Пераключыць карыстальніцкі інтэрфэйс",
                    "toggleFPSInfo": "Уключыць інфармацыю пра FPS і адладку",
                    "switchLayers": "Пераключыць слаі",
                    "exportScreenshot": "Экспартаваць базу ў выглядзе відарыса",
                    "belt": "Стужка",
                    "balancer": "Балансёр",
                    "underground_belt": "Тунэль",
                    "miner": "Здабывальнік",
                    "cutter": "Рэзчык",
                    "rotater": "Рататар",
                    "stacker": "Стасавальнік",
                    "mixer": "Мяшалка фарб",
                    "painter": "Фарбавальнік",
                    "trash": "Сметніца",
                    "storage": "Сховішча",
                    "wire": "Дрот",
                    "constant_signal": "Пастаянны сігнал",
                    "logic_gate": "Лагічны элемент",
                    "lever": "Пераключальнік",
                    "filter": "Фільтр",
                    "wire_tunnel": "Перасячэнне дроту",
                    "display": "Дысплэй",
                    "reader": "Чытач стужкі",
                    "virtual_processor": "Віртульны працэсар",
                    "transistor": "Транзістар",
                    "analyzer": "Аналізатар фігур",
                    "comparator": "Параўнальнік",
                    "item_producer": "Генератар элементаў (пясочніца)",
                    "constant_producer": "Пастаянны вытворца",
                    "goal_acceptor": "Мэтапрымальнік",
                    "block": "Блакіратар",
                    "pipette": "Піпетка",
                    "rotateWhilePlacing": "Павярнуць",
                    "rotateInverseModifier": "Мадыфікатар: Павярнуць супраць гадзіннікавай стрэлкі",
                    "rotateToUp": "Паварот: Кропкай уверх",
                    "rotateToDown": "Паварот: Кропкай уніз",
                    "rotateToRight": "Паварот: Кропкай управа",
                    "rotateToLeft": "Паварот: Кропкай улева",
                    "cycleBuildingVariants": "Пераключэнне варыянтаў",
                    "confirmMassDelete": "Масавае выдаленне",
                    "pasteLastBlueprint": "Паставіць апошні чарцёж",
                    "cycleBuildings": "Пераключэнне будынкаў",
                    "lockBeltDirection": "Уключыць планіроўшчык канвеерных стужак",
                    "switchDirectionLockSide": "Планіроўшчык: Змяніць бок",
                    "copyWireValue": "Драты: Капіяваць значэнне пад курсорам",
                    "massSelectStart": "Утрымлівайце і цягніце каб пачаць",
                    "massSelectSelectMultiple": "Выдзеліць некалькі зон",
                    "massSelectCopy": "Капіяваць зону",
                    "massSelectCut": "Выразаць зону",
                    "massSelectClear": "Адчысціць стужку",
                    "placementDisableAutoOrientation": "Адключыць аўтаматычную арыентацыю",
                    "placeMultiple": "Застацца ў рэжыме размяшчэння",
                    "placeInverse": "Інвертаваць аўтаматычную арыентацыю стужкі",
                    "showShapeTooltip": "Паказваць падказкі фігуры на выхадзе"
                }
                },
                "about": {
                "title": "Пра гульню",
                "body": "Гэта гульні з адкрытым зыходным кодам і створана <a href=\"https://github.com/tobspr\" target=\"_blank\">Tobias Springer</a> (гэта я).<br><br> Калі вы жадаеце зрабіць унёсак, перайдзіце на старонку <a href=\"<githublink>\" target=\"_blank\">shapez on GitHub</a>.<br><br>Гэта гульня не была б магчымай без вялікай Discrod суполкі вакол маіх гульняў - Нагадваю, вам сапраўды варта далучыцца да <a href=\"<discordlink>\" target=\"_blank\">Discord server</a>!<br><br>Саундтрэк быў зроблены <a href=\"https://soundcloud.com/pettersumelius\" target=\"_blank\">Peppsen</a> - Ён проста цудоўны.<br><br>Нарэшце, вялікая падзяка майму лепшаму сябру <a href=\"https://github.com/niklas-dahl\" target=\"_blank\">Niklas</a> - Без нашых сесій у Factorio, гэтай гульні бы не існавала."
                },
                "changelog": {
                "title": "Журнал змен"
                },
                "demo": {
                "features": {
                    "restoringGames": "Аднаўленне захоўванняў",
                    "importingGames": "Імпартаванне захоўванняў",
                    "oneGameLimit": "Абмежавана адным захоўваннем",
                    "customizeKeybindings": "Уласныя прызначаныя клавішы",
                    "exportingBase": "Экспартаванне цэлай базы ў выглядзе відарыса"
                },
                "settingNotAvailable": "Не даступна ў дэма-версіі."
                },
                "backendErrors": {
                "ratelimit": "Вы выконваеце свае дзеянні занадта часта. Крыху пачакайце.",
                "invalid-api-key": "Не ўдалося звязацца з бэкэндам, паспрабуйце абнавіць/перазапусціць гульню (няправільны ключ API).",
                "unauthorized": "Не ўдалося звязацца з бэкэндам, паспрабуйце абнавіць/перазапусціць гульню (Не аўтарызавана).",
                "bad-token": "Не ўдалося звязацца з бэкэндам, паспрабуйце абнавіць/перазапусціць гульню (Дрэнны токен).",
                "bad-id": "Няправільны ідэнтыфікатар складанкі.",
                "not-found": "Не атрымалася знайсці дадзеную складанку.",
                "bad-category": "Не атрымалася знайсці дадзеную катэгорыю.",
                "bad-short-key": "Дадзены кароткі ключ памылковы.",
                "profane-title": "Назва вашай складанкі змяшчае абражальныя словы.",
                "bad-title-too-many-spaces": "Назва вашай складанкі занадта кароткая.",
                "bad-shape-key-in-emitter": "Пастаянны вытворца змяшчае памылковы прадмет.",
                "bad-shape-key-in-goal": "Мэтапрымальнік змяшчае памылковы прадмет.",
                "no-emitters": "Ваша складанка не змяшчае ніводнага пастаяннага вытворцы.",
                "no-goals": "Ваша складанка не змяшчае ніводнага мэтапрымальніка.",
                "short-key-already-taken": "Гэты кароткі ключ ужо заняты, калі ласка, выкарыстоўвайце іншы ключ.",
                "can-not-report-your-own-puzzle": "Вы не можаце паскардзіцца на сваю ўласную складанку.",
                "bad-payload": "Запыт змяшчае памылковыя даныя.",
                "bad-building-placement": "Ваша складанка змяшчае няправільна ўсталяваныя будынкі.",
                "timeout": "Час чакання запыта скончыўся.",
                "too-many-likes-already": "Ваша складанка атрымала вельмі шмат лайкаў. Калі вы ўсё яшчэ жадаеце яе выдаліць, дашліце ліст на пошту support@shapez.io!",
                "no-permission": "У вас няма дазволу на выкананне гэтага дзеяння."
                },
                "tips": [
                "Цэнтр будзе прымаць любы ўвод, а не толькі патрэбную фігуру!",
                "Пераканайцеся, што вашыя фабрыкі модульны - гэта акупіцца!",
                "Не будуйцеся занадта блізка да цэнтру, інакш гэта перарасце ў сметніцу!",
                "Калі стасавальнік не працуе, паспрабуйце памяняць месцамі ўваходы.",
                "Вы можаце пераключаць планіроўшчык канвеераў націснуўшы <b>R</b>.",
                "Утрымліваючы <b>CTRL</b> вы можаце перацягнуць канвееры не змяняючы іх арыентацыю.",
                "Суадносіны застаюцца ранейшымі, пакуль усе мадэрнізацыі знаходзяцца на адным узроўні.",
                "Паслядоўнае выкананне больш эфектыўнае, чым паралельнае.",
                "Вы разблакуеце больш варыянтаў будынкаў пазней!",
                "Вы можаце карыстацца <b>T</b> каб пераключацца паміж варыянтамі.",
                "Сіметрыя - ключ!",
                "Вы можаце пераплятаць тунэлі розных рангаў.",
                "Паспрабуйце будаваць кампактныя фабрыкі - гэта акупіцца!",
                "Фарбавальнік мае адлюстраваны варыянт, які можна ўключыць праз <b>T</b>.",
                "Наяўнасць правільных суадносін будынкаў дазволіць павялічыць эфектыўнасць.",
                "На максімальным узроўні 5 здабывальнікаў будуць запаўняць адну стужку.",
                "Не забывайце пра тунэлі!",
                "Вам не трэба раўнамерна дзяліць прадметы для поўнай эфектыўнасці.",
                "Утрымліванне <b>SHIFT</b> актывуе планіроўшчык стужак, які дазволіць вам лёгка будаваць вялікія канвеерныя стужкі.",
                "Рэзчыкі заўсёды рэжуць вертыкальна, незалежна ад іх арыентацыі.",
                "Змяшайце ўсе тры галоўныя колеры, каб атрымаць белы.",
                "Левы ўваход Сховішча прыярытэтны.",
                "Інвестуйце час у стварэнне паўтаральных дызайнаў - гэта акупіцца!",
                "Утрымліванне <b>SHIFT</b> дазваляе вам размяшчаць некалькі будынкаў адначасова.",
                "Вы можаце ўтрымліваць <b>ALT</b>, каб змяніць накірунак размешчанных стужак.",
                "Эфектыўнасць - гэта ключ!",
                "Крыніцы фігур, што змяшчаюцца далей ад Цэнтру, маюць боль складаныя фігуры.",
                "Машыны маюць абмежаваную хуткасць, размяркоўвайце нагрузку паміж імі, каб палепшыць эфектыўнасць.",
                "Выкарыстоўвайце балансёры, для максімізацыі эфектыўнасці.",
                "Арганізаванасць - гэта вельмі істотна. Паспрабуйце не перакрыжоўваць канвееры вельмі часта.",
                "Плануйце загадзя, або ўсё ператворыцца ў сметніцу!",
                "Не разбурайце старыя фабрыкі! Яны спатрэбяцца вам, каб разблакаваць паляпшэнні.",
                "Паспрабуйце адолець 20 ці 26 узровень сваімі сіламі, без дапамогі!",
                "Не ўскладняйце, паспрабуйце прытрымлівацца прастаты і ў вас усё атрымаецца.",
                "Магчыма, вам спатрэбіцца выкарыстоўваць пабудаваныя фабрыкі пазней. Будуйце іх для шматразовага выкарыстання.",
                "Час ад часу, вы можаце знайсці патрэбныя фігуры без іх стварэння.",
                "Цэлая фігура млын/вятрак ніколі не з'явіцца натуральным чынам.",
                "Для максімальнай эфектыўнасці, фарбуйце вашыя фігуры, перад іх разразаннем.",
                "З модулямі прастора - гэта проста ўспрыманне; клопат для смяротных.",
                "Зрабіце асобную фабрыку для чарцяжоў. Яны вельмі істотныя для модуляў.",
                "Прыгледзьцеся да змяшчальнікаў колераў бліжэй і атрымаеце адказы на свае пытанні.",
                "Выкарыстоўвайце <b>CTRL</b> + Перасоўванне мышы, каб выдзеліць вобласць.",
                "Будоўля паблізу Цэнтра можа нашкодзіць у пазнейшых праектах.",
                "Іконка \"шпількі\" побач з фігурай у спісе паляпшэнняў замацоўвае фігуру на экране.",
                "Змяшайце ўсе тры асноўныя колеры, каб атрымаць белы!",
                "У вас бясконцая мапа. Не сціскайце фабрыкі, пашырайцеся!",
                "Таксама паспрабуйце Factorio! Гэта мая ўлюбёная гульня.",
                "Рэзчык (4 вых.) рэжа па гадзіннікавай стрэлцы, пачынаючы з верхняга правага кута.",
                "Вы можаце зпампаваць вашыя захоўванні ў галоўным меню!",
                "У гульні шмат карысных прывязак да клавіш! Вы можаце паглядзець іх у наладах.",
                "У гульні шмат розных наладаў, не забудзьцеся паглядзець іх!",
                "Пазнака вашага цэнтру мае невялікі компас, які заўсёды паказвае ў яго накірунку!",
                "Каб адчысціць стужкі, выражце вобласць а затым устаўце яе на тое самае месца.",
                "Націсніце F4, каб убачыць ваш FPS і частату цыклаў абнаўленняў.",
                "Націсніце F4 двойчы, каб убачыць каардынаты пліткі пад вашай мышой і самой камеры.",
                "Вы можаце націснуць на фігуру, зачэпленую ў левым куце, каб адчапіць яе."
                ]
            },
            code: "be",
            region: "",
        }
    }
}
